Tekla Open API Reference for Tekla Structures 2025
Mesh.AddLine Method
 Adds a new line in the mesh.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void AddLine(
	int Index1,
	int Index2
)
Public Sub AddLine (
	Index1 As Integer,
	Index2 As Integer
)
Parameters
Index1
Type: System.Int32
The index of the line's start point in the points array list.
Index2
Type: System.Int32
The index of the line's end point in the points array list.
See Also
Reference
Mesh Class
Tekla.Structures.Model.UI Namespace